import React, { Component } from "react";
import { withRouter } from "react-router-dom";
import { Form, Button, Checkbox , Divider } from "antd";


class Termandcondition extends Component {

  constructor(props, context) {
    super(props, context);
    this.onEnter = this.onEnter.bind(this);
    this.onTickCheckbox = this.onTickCheckbox.bind(this);
    this.state = {
      acceptCondition : false

    }
  }

  componentDidMount() {
    
  }

  onTickCheckbox(){
    this.setState({ acceptCondition : !this.state.acceptCondition });
  }

  onEnter(){
    this.props.history.push("/2");
  }

  render() {

    return (
      // <Form >
        <div >
        <div style={{ maxHeight : "60vh" , overflow : "scroll" , marginLeft: "10vh" , marginRight: "10vh" }}>
        <p><strong>กฎระเบียบและข้อบังคับ</strong></p>
        <p>&nbsp;</p>
        <p>General</p>
        <p>o INTANIA CHULA MINI MARATHON 2019 (ICMM2019) <span>จัดขึ้นเพื่อส่งเสริมและสนับสนุนให้นิสิตเก่า นิสิตปัจจุบัน และประชาชนทั่วไปได้ออกกำลังกายเพื่อสุขภาพ จัดโดย ทีมผู้จัดงานของคณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย</span>("<span>ผู้จัดงาน") และ</span> Grouppe <span>เป็นระบบรับสมัคร</span>(&ldquo;Organizer&rdquo;)<span> ตามข้อกำหนดและเงื่อนไข ("</span>R &amp; R") <span>และข้อกำหนดและเงื่อนไข ("</span>T &amp; Cs") <span>ดังต่อไปนี้</span></p>
        <p>&nbsp;</p>
        <p>การลงทะเบียน ICMM2019 <span>โดยส่งข้อมูลไปยัง </span>Organizer (<span>และ / หรือหน่วยงานที่เกี่ยวข้อง) ไม่ว่าจะเพื่อวัตถุประสงค์ในการลงทะเบียน </span>ICMM2019 <span>หรืออื่น ๆ หรือการใช้งาน คุณลักษณะใด ๆ ของเว็บไซต์ดังกล่าวหมายความว่าคุณได้อ่านเข้าใจและตกลงที่จะผูกพันตามนโยบายความเป็นส่วนตัวที่กำหนดไว้ด้านล่าง (ซึ่งมีการแก้ไขเป็นครั้งคราว) ในส่วนที่เกี่ยวกับการเก็บรวบรวมการใช้และการเปิดเผยข้อมูลส่วนบุคคลของคุณ นอกจากนี้คุณตกลงอย่างชัดแจ้งตกลงและยินยอมให้ </span>Organizer (<span>รวมถึงหน่วยงานที่เกี่ยวข้องรวมถึงตัวแทนของตน) ในการรวบรวมการใช้และการเปิดเผยข้อมูลส่วนบุคคลของคุณในลักษณะที่กำหนดไว้ในนโยบายดังกล่าว การกรอกแบบฟอร์มการลงทะเบียนออนไลน์เป็นการยืนยันข้อตกลงของผู้เข้าร่วมกิจกรรมที่จะปฏิบัติตาม </span>R &amp; R <span>เหล่านี้ การลงทะเบียนสำหรับการแข่งขันจะได้รับการยืนยันเฉพาะเมื่อชำระเงินและออกหมายเลขประจำตัวการแข่งขัน ผู้เข้าร่วมยินยอมที่จะ:</span></p>
        <ul>
        <li>ให้ข้อมูลที่เป็นจริงถูกต้องเป็นปัจจุบันและครบถ้วนเกี่ยวกับผู้เข้าร่วมที่มีอยู่ในแบบฟอร์มการลงทะเบียน ("ข้อมูลส่วนบุคคล")</li>
        <li>ให้รักษาความปลอดภัยของรหัสประจำตัวของผู้เข้าร่วมการแข่งขัน</li>
        <li>ให้รักษาและปรับปรุงข้อมูลส่วนบุคคลอย่างทันท่วงทีเพื่อให้เป็นไปอย่างถูกต้องเป็นปัจจุบันและครบถ้วน ผู้จัดงานอาจติดต่อผู้เข้าร่วมประชุมเป็นครั้งคราวทางอีเมล ประกาศใด ๆ ที่ส่งไปยังที่อยู่อีเมลที่ลงทะเบียนไว้กับผู้จัดจะถือเป็นที่ได้รับโดยผู้เข้าร่วม หากผู้เข้าร่วมประชุมให้ข้อมูลใด ๆ ที่ไม่ถูกต้องไม่ถูกต้องไม่เป็นปัจจุบันหรือไม่สมบูรณ์หรือหากผู้จัดมีเหตุผลอันสมควรที่จะสงสัยว่าข้อมูลดังกล่าวเป็นความจริงไม่ถูกต้องไม่เป็นปัจจุบันหรือไม่สมบูรณ์ Organizer <span>อาจระงับหรือยกเลิกการลงทะเบียนและปฏิเสธการเข้าร่วมโครงการ ผู้เข้าอบรมสามารถใช้เว็บไซต์ทางการ (หรือส่วนใดส่วนหนึ่ง) ในอนาคตได้โดยไม่ต้องมีการเปลี่ยนแปลงรายละเอียดการลงทะเบียนเมื่อการลงทะเบียนเสร็จสิ้น ผู้จัดงานขอสงวนสิทธิ์ในการแก้ไขหรือเปลี่ยนตัว </span>R &amp; R <span>และ / หรือ </span>T &amp; C <span>เหล่านี้เป็นครั้งคราวตามที่ผู้จัดงานเห็นสมควร หากมีความคลุมเครือในบทบัญญัติใด ๆ เหล่านี้ </span>Organizer <span>จะเป็นผู้มีอำนาจในการตีความบทบัญญัติเหล่านี้และในการดำเนินการดังกล่าว </span>Organizer <span>จะคำนึงถึงผลประโยชน์ของผู้เข้าร่วมที่ได้รับผลกระทบทั้งหมด การแก้ไขใด ๆ เกี่ยวกับ </span>R &amp; R <span>และ / หรือ </span>T &amp; Cs <span>จะได้รับการปรับปรุงในเว็บไซต์อย่างเป็นทางการ ผู้จัดงานขอสงวนสิทธิ์ในการยกเลิก </span>ICMM2019 <span>ได้ตลอดเวลาโดยไม่ต้องแจ้งให้ผู้เข้าอบรมทราบล่วงหน้าซึ่งในกรณีดังกล่าวจะต้องให้ความสำคัญในการแจ้งให้ผู้เข้าร่วมประชุมทราบล่วงหน้าก่อนวันที่จัดงาน ถ้ายกเลิก </span>ICMM2019 <span>จะไม่มีการคืนเงินค่าธรรมเนียมที่ชำระ ไม่มีผู้จัดกิจกรรมหรือผู้สนับสนุนร่วมจะต้องรับผิดในความสูญเสียหรือความไม่สะดวกอื่น ๆ ที่เกิดขึ้น ผู้จัดงานขอสงวนสิทธิ์ในการแก้ไขเส้นทางการแข่งขัน </span>ICMM2019 <span>เนื่องจากออแกไนเซอร์เห็นว่าเหมาะสมกับความปลอดภัยของผู้เข้าร่วมกิจกรรมและ / หรือเพื่อป้องกันอันตรายใด ๆ ที่อาจเกิดขึ้นในการแข่งขันโดยไม่ต้องแจ้งให้ผู้เข้าร่วมทราบล่วงหน้า ในกรณีดังกล่าวจะมีการแจ้งให้ผู้เข้าร่วมทราบทุกครั้งก่อนวัน / วันที่จัดงาน ไม่มีผู้จัดงานหรือผู้สนับสนุนร่วมจะต้องรับผิดต่อความสูญเสียหรือความไม่สะดวกอื่น ๆ ที่เกิดขึ้น</span></li>
        </ul>
        <p>&nbsp;</p>
        <p>Safety and other precautions</p>
        <p>แม้ว่า Organizer <span>จะดำเนินการเพื่อความปลอดภัยของผู้เข้าร่วมการแข่งขัน แต่ผู้เข้าแข่งขันจะมีส่วนร่วมในกิจกรรม </span>ICMM2019 <span>(การทำ </span>PACER, <span>การฝึกอบรม ที่เกี่ยวข้องกับ </span>ICMM2019) <span>โดยความเสี่ยงของตัวเอง ในส่วนที่ได้รับอนุญาตตามกฎหมายไม่ว่าจะเป็นผู้จัดงาน, ผู้จัดกิจกรรม หรือผู้สนับสนุนร่วมจะไม่รับผิดชอบหรือรับผิดชอบต่อการบาดเจ็บหรือเสียชีวิตจากการฝึกซ้อมหรือระหว่างการเข้าร่วม </span>ICMM2019 <span>ผู้เข้าร่วมการแข่งขันควรปรึกษาแพทย์ก่อนการลงทะเบียนและก่อนวันแข่งขันจริง</span></p>
        <p>&nbsp;</p>
        <p>Cancellation</p>
        <p>After registration, there will be no fee refund for a Participant who does not eventually take part in the ICMM2019, for any reason whatsoever. A Participant is strictly not allowed to transfer his or her race entry to another party. Any Participant who commences before the actual start time of the race category for which he or she is registered will be disqualified. The start time for the respective race categories can be found on the Official ICMM2019 contact channel. A Participant who does not start within the time given from his or her respective flag off point (Mini 10km, Fun run 5km Men/Women/Kids) will be disqualified and, for safety reasons, may not be allowed to start.</p>
        <p>&nbsp;</p>
        <p>Baggage Deposit</p>
        <p>ผู้จัดงานจะไม่รับผิดชอบต่อความสูญเสียและ / หรือความเสียหายที่เป็นส่วนตัวหรือสิ่งอื่นใดต่อสิ่งของและสิ่งของที่วางไว้ในสถานที่จัดเก็บสัมภาระ ผู้จัดงานขอสงวนสิทธิ์ในการเปิดและตรวจสอบสินค้าหรือสัมภาระที่วางไว้เพื่อความปลอดภัย</p>
        <p>&nbsp;</p>
        <p>&nbsp;</p>
        <p>ตารางเงินรางวัล</p>
        <p>ผู้เข้าร่วมแต่ละรายได้รับรางวัลรางวัลรางวัลเพียงหนึ่งรางวัลเท่านั้น ผู้เข้าร่วมที่ชนะสามารถเลือกที่จะได้รับรางวัลในประเภทรางวัลอื่นที่เขาหรือเธอมีสิทธิ์ซึ่งอาจให้รางวัลเงินรางวัลสูงกว่า แม้ว่าการเลือกตั้งของผู้เข้าร่วมการแข่งขันการจบการแข่งขันในประเภทรางวัลแต่ละประเภทจะไม่เปลี่ยนแปลงไป ผู้จัดงานขอสงวนสิทธิ์ในการเปลี่ยนผู้ชนะหากพบว่าถูกตัดสิทธิ์ การรวบรวมรางวัลจะดำเนินการหลังจากที่ได้ส่งข้อมูลรางวัลสำหรับผู้โชคดีและสำเนาหนังสือเดินทางหรือ Photo ID <span>ของผู้เข้าร่วมการประกวด ในกรณีที่ส่งแบบฟอร์มไม่สมบูรณ์ผู้เข้าร่วมจะต้องส่งใหม่และผู้จัดงานขอสงวนสิทธิ์ในการปฏิเสธฟอร์มที่ไม่สมบูรณ์ รางวัลทั้งหมดที่ไม่ได้รับการเรียกร้องภายในหนึ่ง (</span>1) <span>เดือนนับจากที่ได้มีการส่งข้อมูลของผู้ชนะสำหรับแบบฟอร์มเงินรางวัลจะถูกริบและผู้จัดงานจะได้รับสิทธิ์ในการแจกจ่ายหรือจำหน่ายต่อไป รางวัลจะต้องดำเนินการในรูปแบบที่จัดโดย </span>Organizer <span>ไม่สามารถโอนหรือแลกเปลี่ยนเป็นเงินสดและอยู่ภายใต้ </span>R &amp; R <span>และ / หรือ </span>T &amp; C <span>ตามที่กำหนดโดยผู้จัดงาน "</span>Gun Time" <span>จะถูกพิจารณาเพื่อกำหนดผู้ชนะสำหรับทุกประเภท รางวัลมาราธอน - </span>42.195km <span>ได้แก่ รางวัล </span>Men's Open, Women's Open, <span>ชายไทย</span>, <span>หญิงไทย</span></p>
        <p>The individual prizes for Half Marathon &ndash; 21.1km are: Men&rsquo;s Open, Women&rsquo;s Open, Thai Men, Thai Women. The individual prizes for 10km are: Men&rsquo;s Open, Women&rsquo;s Open, Thai Men, Thai Women.</p>
        <p>&nbsp;</p>
        <p>*Only Participants who are Thai Nationals, are eligible to compete for Thai categories. Participants who are Permanent Residents of Thailand are eligible to compete for the Men&rsquo;s Open/Women&rsquo;s Open.</p>
        <p>&nbsp;</p>
        <p>รางวัล Family Fun Run <span>จะไม่ได้รับรางวัลเนื่องจากเป็นการแข่งขันที่ไม่เป็นทางการ สำหรับผู้ที่ได้รับรางวัลหรือผู้ที่ได้รับรางวัลจะต้องมีการยื่นอุทธรณ์ข้อพิพาทในสถานที่ด้วยตัวเองในรูปแบบที่เป็นลายลักษณ์อักษรโดยมีค่าธรรมเนียมการอุทธรณ์ </span>USD100<span> ภายในไม่กี่นาที </span>30<span> นาทีจากผลการเผยแพร่ในกระดานแจ้งผลการประเมินผลในสถานที่หรือทันทีที่ การนำเสนอรางวัลใด ๆ ก็ตามก่อนหน้านี้ สำหรับผู้เข้าร่วมรายอื่นทั้งหมดการยื่นอุทธรณ์เกี่ยวกับข้อพิพาทเกี่ยวกับผลลัพธ์จะต้องส่งเป็นลายลักษณ์อักษรโดยมีค่าธรรมเนียมการอุทธรณ์ </span>USD100<span> รวมถึงจดหมายอิเล็กทรอนิกส์ภายใน </span>7<span> วันนับจากวันแข่งขัน ผู้จัดงานขอสงวนสิทธิ์ไม่ให้ความสนใจในการอุทธรณ์ใด ๆ หลังจาก </span>12 February 2018<span> กรุณาส่งจดหมายอุทธรณ์ของคุณไปที่: </span>ATMBKK Organizing Committee c / o <span>ผู้จัดงานประเทศไทย </span>Ltd, 201<span> ซอย </span>Pradit Ma Nutham 1<span> ถนนประดิษฐ์ </span>Ma Nutham, Wangthonglang Bangkok 10310<span> ประเทศไทยและเช็คที่ต้องชำระให้กับ: บริษัท ผู้จัดงาน </span>Thiland <span>จำกัด และส่งอีเมลไปที่ </span>ThailandMarathon@The Organiser.com</p>
        <p>&nbsp;</p>
        <p>Race Kit Collection (&lsquo;RKC&rsquo;)</p>
        <p>ผู้เข้าร่วมทุกคนจะต้องเก็บชุดการแข่งขัน ("RKC") <span>ซึ่งรวมถึงอุปกรณ์แข่งรถ</span>, <span>อุปกรณ์จับเวลา (ติดอยู่กับเอี๊ยมแข่ง) และสิ่งใหม่ ๆ ที่สถานที่จัดเก็บ </span>Race Entry Pack Collection ("REPC") <span>ในระหว่างการจัดเก็บ ("ระยะเวลาเก็บรวบรวม") ซึ่งรายละเอียดจะระบุไว้ในเว็บไซต์อย่างเป็นทางการ หากผู้เข้าร่วมกิจกรรมไม่สามารถเก็บรวบรวมชุดแข่งขันได้ด้วยตัวเองบุคคลเหล่านี้อาจมอบอำนาจให้ตัวแทนที่ได้รับมอบอำนาจอย่างถูกต้องตามขั้นตอนที่ระบุไว้ในเว็บไซต์อย่างเป็นทางการ จะไม่มีชุดของชุดการแข่งขันออกจากกำหนดเวลาเก็บรวบรวม การจัดเก็บล่าช้าจะไม่ได้รับความบันเทิงและออแกไนเซอร์จะไม่รับผิดชอบต่อความสูญเสียหรือความไม่สะดวกอื่นใดที่เกิดขึ้นเนื่องจากผู้เข้าร่วมไม่สามารถจัดเก็บชุดแข่งขันของตนได้ไม่ว่าด้วยเหตุใด ๆ เพื่อหลีกเลี่ยงข้อสงสัยผู้จัดจะไม่ต้องขยายระยะเวลาเก็บหนี้หรือเพื่อให้มั่นใจว่าผู้เข้าร่วมจะได้รับ </span>Pack Race Entry Pack <span>ตลอดเวลาผู้เข้าร่วมต้องรับผิดชอบในการรวบรวมชุดแข่งขันของตนในช่วงระยะเวลาเก็บรวบรวม แพ็คเกจการแข่งขันที่ไม่ได้เก็บในช่วงระยะเวลาเก็บรวบรวมจะถือว่าไม่เป็นที่ต้องการและ </span>Organizer <span>จะมีสิทธิ์ในการทิ้งหรือแจกจ่ายให้ใหม่</span></p>
        </div>

        <Divider style= {{ marginTop : "5vh" }} />
        <div style= {{display : "flex", flexFlow: "column wrap" }} >
        <Checkbox style={{ marginLeft : "20vh"  }} onClick={this.onTickCheckbox} > คุณได้ยอมรับเงื่อนไขด้านบนทั้งหมดแล้ว</Checkbox>
        <Button  
        style= {{ width : "50vh" , margin: "0 auto" , marginTop : "2vh"}} 
        disabled={this.state.acceptCondition ? false : true} 
        type="primary"
        onClick={this.onEnter}> ตกลง </Button>
        </div>


        </div>
        


 
    );
  }
}

export default withRouter(Form.create()(Termandcondition));
